# Horizontal to vertical

## Pandas

In [1]:
import pandas as pd

In [2]:
pd_hotel_sales = pd.read_parquet("../../data/hotel_sales.parquet")

In [3]:
pd_hotel_sales.head()

     month   business   minshuku     resort     ryokan
0  2015-01  188593900  168848500  185781400  187620400
1  2015-02  163494800  158697900  160538300  167680000
2  2015-03  375910200  342336600  362523600  367224800
3  2015-04  173913200  164582900  180903800  178178600
4  2015-05  552326800  517123500  560898500  555369200

In [4]:
pd_hotel_sales.melt(id_vars="month", var_name="hotel_type", value_name="sales")

       month hotel_type      sales
0    2015-01   business  188593900
1    2015-02   business  163494800
2    2015-03   business  375910200
3    2015-04   business  173913200
4    2015-05   business  552326800
..       ...        ...        ...
235  2019-08     ryokan  759281900
236  2019-09     ryokan  178433900
237  2019-10     ryokan  191096100
238  2019-11     ryokan  176944100
239  2019-12     ryokan  373322300

[240 rows x 3 columns]

## Polars

In [5]:
import polars as pl

In [6]:
pl_hotel_sales = pl.read_parquet("../../data/hotel_sales.parquet")

In [7]:
pl_hotel_sales.head()

shape: (5, 5)
┌─────────┬───────────┬───────────┬───────────┬───────────┐
│ month   ┆ business  ┆ minshuku  ┆ resort    ┆ ryokan    │
│ ---     ┆ ---       ┆ ---       ┆ ---       ┆ ---       │
│ str     ┆ i64       ┆ i64       ┆ i64       ┆ i64       │
╞═════════╪═══════════╪═══════════╪═══════════╪═══════════╡
│ 2015-01 ┆ 188593900 ┆ 168848500 ┆ 185781400 ┆ 187620400 │
│ 2015-02 ┆ 163494800 ┆ 158697900 ┆ 160538300 ┆ 167680000 │
│ 2015-03 ┆ 375910200 ┆ 342336600 ┆ 362523600 ┆ 367224800 │
│ 2015-04 ┆ 173913200 ┆ 164582900 ┆ 180903800 ┆ 178178600 │
│ 2015-05 ┆ 552326800 ┆ 517123500 ┆ 560898500 ┆ 555369200 │
└─────────┴───────────┴───────────┴───────────┴───────────┘

In [8]:
pl_hotel_sales.melt(id_vars="month", variable_name="hotel_type", value_name="sales")

/tmp/ipykernel_38176/4087146158.py:1: DeprecationWarning: `DataFrame.melt` is deprecated. Use `unpivot` instead, with `index` instead of `id_vars` and `on` instead of `value_vars`
  pl_hotel_sales.melt(id_vars="month", variable_name="hotel_type", value_name="sales")

shape: (240, 3)
┌─────────┬────────────┬───────────┐
│ month   ┆ hotel_type ┆ sales     │
│ ---     ┆ ---        ┆ ---       │
│ str     ┆ str        ┆ i64       │
╞═════════╪════════════╪═══════════╡
│ 2015-01 ┆ business   ┆ 188593900 │
│ 2015-02 ┆ business   ┆ 163494800 │
│ 2015-03 ┆ business   ┆ 375910200 │
│ 2015-04 ┆ business   ┆ 173913200 │
│ 2015-05 ┆ business   ┆ 552326800 │
│ …       ┆ …          ┆ …         │
│ 2019-08 ┆ ryokan     ┆ 759281900 │
│ 2019-09 ┆ ryokan     ┆ 178433900 │
│ 2019-10 ┆ ryokan     ┆ 191096100 │
│ 2019-11 ┆ ryokan     ┆ 176944100 │
│ 2019-12 ┆ ryokan     ┆ 373322300 │
└─────────┴────────────┴───────────┘